---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewportAttrOrientationOnSheet
source: html/20ec354d-73f0-1fce-008a-2c1c9cab3323.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewportAttrOrientationOnSheet Property

"Rotation on Sheet"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewportAttrOrientationOnSheet { get; }
```